outputs/benchmarks/fp8_speculative_bench_20260702_102557.txt
# Benchmark metadata
config=fp8_speculative
date=2026-07-02T10:25:57+00:00
git_commit=273b8dd18605a922c39611731d3b63d1a49df037
model_for_bench=/home/nnamd/spec_dec_quant_hw/outputs/checkpoints/eagle3_qwen3_8b_sharegpt_full_20260701_110123/checkpoint_best
tokenizer_for_bench=Qwen/Qwen3-8B
base_url=http://localhost:8000
dataset_name=hf
dataset_path=philschmid/mt-bench
max_concurrency=8
num_prompts=80

# vLLM bench output
INFO 07-02 10:26:02 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
WARNING 07-02 10:26:02 [nixl_utils.py:34] NIXL is not available
WARNING 07-02 10:26:02 [nixl_utils.py:44] NIXL agent config is not available
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7b9179b53380>, trust_remote_code=False, seed=0, num_prompts=80, dataset_name='hf', no_stream=False, dataset_path='philschmid/mt-bench', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='/home/nnamd/spec_dec_quant_hw/outputs/checkpoints/eagle3_qwen3_8b_sharegpt_full_20260701_110123/checkpoint_best', input_len=None, output_len=None, tokenizer='Qwen/Qwen3-8B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-677c28fe-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 80/80 [00:16<00:00,  4.88it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     80        
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  16.39     
Total input tokens:                      6078      
Total generated tokens:                  20480     
Request throughput (req/s):              4.88      
Output token throughput (tok/s):         1249.78   
Peak output token throughput (tok/s):    927.00    
Peak concurrent requests:                16.00     
Total token throughput (tok/s):          1620.69   
---------------Time to First Token----------------
Mean TTFT (ms):                          70.37     
Median TTFT (ms):                        26.30     
P99 TTFT (ms):                           477.86    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          5.93      
Median TPOT (ms):                        6.02      
P99 TPOT (ms):                           6.74      
---------------Inter-token Latency----------------
Mean ITL (ms):                           8.66      
Median ITL (ms):                         8.60      
P99 ITL (ms):                            9.45      
---------------Speculative Decoding---------------
Acceptance rate (%):                     15.34     
Acceptance length:                       1.46      
Drafts:                                  13988     
Draft tokens:                            41964     
Accepted tokens:                         6439      
Per-position acceptance (%):
  Position 0:                            35.79     
  Position 1:                            8.74      
  Position 2:                            1.50      
==================================================